app/views/devise/registrations/edit.html.erb

SELECT `branches`.* FROM `branches`
---
        <%= f.input :email,label: "Correo electrónico", required: true, placeholder: "Correo electrónico", disabled: true %>
        <%= f.association :group, label: false, collection: Branch.all, as: :grouped_select, group_method: :groups %><br>