app/views/devise/registrations/new.html.erb

SELECT `branches`.* FROM `branches`
---
        <%= f.input :email,label: false, required: true, placeholder: "Correo electrónico" %>
        <%= f.association :branch, prompt: "Selecciona una sede", collection: Branch.all, label:false  %>