app/views/pages/show.html.erb


        $(".save").click(function(e) {
          e.preventDefault();

          var autoCorrector = <%= @page.auto_corrector %>;

          if (autoCorrector) {
            if (isValidCode(editor.getValue())) {
              saveAnswer(true);
            } else {
              numberAttempts = numberAttempts + 1;
              if (numberAttempts < 3) {
                swal({
                  title: "¡Ups! Parece que debes revisar tu código.",
                  text: "Inténtalo de nuevo y revisa que estés colocando el texto exacto, incluyendo los signos de puntuación",
                  type: "error",
                  confirmButtonText: "OK",
                });
              } else {
                swal({
                  title: "¿Problemas?",
                  text: "Hemos notado que te estás quedando atascada con este ejercicio, mejor continua con los demás y de ahi regresas por este.",
---
INSERT INTO `answers` (`page_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 8, '2015-11-03 05:26:48', '2015-11-03 05:26:48')

      function onYouTubePlayerAPIReady() {
        player = new YT.Player('video-content', {
          height: '390',
          width: '640',
          videoId: '<%= @page.videos.first.youtube if @page.videos.first != nil %>',
          events: {
            'onStateChange': onPlayerStateChange
          }
        });
---
SELECT  `videos`.* FROM `videos` INNER JOIN `pages_videos` ON `videos`.`id` = `pages_videos`.`video_id` WHERE `pages_videos`.`page_id` = 1  ORDER BY `videos`.`id` ASC LIMIT 1

    <ol class="units">
      <% @unit.pages.order(:sequence).each do |page| %>
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2 AND `pages`.`sequence` = 2 LIMIT 1

              title="<%= page.title %>">
            <% if !page.answers.where(:user_id => current_user.id).empty? || page.page_type == "opener" %>
              <%= link_to mycourse_unit_page_path(@course,page.unit,page),
                  :class => "clearfix item #{((page.page_type == "editor" and page.answers.where(:user_id => current_user.id).first !=nil and page.answers.where(:user_id => current_user.id).first.result == nil) ? "red-viewed" : "viewed")}" do %>
---
SELECT  1 AS one FROM `answers` WHERE `answers`.`page_id` = 2 LIMIT 1
SELECT  `answers`.* FROM `answers` WHERE `answers`.`page_id` = 3 AND `answers`.`page_id` = 3 AND `answers`.`user_id` = 8 LIMIT 1
SELECT  `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2 AND `pages`.`id` = 1 LIMIT 1
SELECT  `units`.* FROM `units` WHERE `units`.`course_id` = 3 AND `units`.`id` = 2 LIMIT 1