app/views/courses/show.html.erb

SELECT COUNT(*) FROM `pages` WHERE `pages`.`unit_id` = 1
---
            <h3>
              <b>Unit <%= index + 1 %> | <%= unit.pages.count %> retos</b>