app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT `courses`.* FROM `courses`

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO `courses` (`name`, `description`, `avatar_file_name`, `avatar_content_type`, `avatar_file_size`, `avatar_updated_at`, `created_at`, `updated_at`) VALUES ('FRONT-END FOUNDATIONS', 'Learn how to create a website with HTML and CSS, and in the process build a strong foundation for more advanced front-end development.', 'front-end.png', 'image/png', 46521, '2015-07-12 17:54:07', '2015-07-12 17:54:07', '2015-07-12 17:54:07')

  def update
    respond_to do |format|
      if @course.update(course_params)
---
UPDATE `courses` SET `color` = '#284C4A', `background_image_file_name` = 'course-background.jpg', `background_image_content_type` = 'image/jpeg', `background_image_file_size` = 46924, `background_image_updated_at` = '2015-07-12 19:09:26', `updated_at` = '2015-07-12 19:09:26' WHERE `courses`.`id` = 3

  def destroy
    @course.destroy
---
DELETE FROM `courses` WHERE `courses`.`id` = 1

    def set_course
      @course = Course.find(params[:id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1