app/controllers/pages_controller.rb

  def index
    @pages = @unit.pages.all
---
SELECT `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2

  def show
    @page = @unit.pages.find(params[:id])
    @previous_page = @unit.pages.find_by_sequence(@page.sequence-1)
    @next_page = @unit.pages.find_by_sequence(@page.sequence+1)
    @page.answers.find_or_create_by(page_id: @page.id,user_id: current_user.id)
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2 AND `pages`.`id` = 1 LIMIT 1
SELECT  `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2 AND `pages`.`sequence` = 2 LIMIT 1
INSERT INTO `answers` (`page_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 8, '2015-11-03 05:26:48', '2015-11-03 05:26:48')
SELECT  `answers`.* FROM `answers` WHERE `answers`.`page_id` = 3 AND `answers`.`page_id` = 3 AND `answers`.`user_id` = 8 LIMIT 1

  def edit
    @page = @unit.pages.find(params[:id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2 AND `pages`.`id` = 1 LIMIT 1

  def create
    @page = @unit.pages.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO `pages` (`title`, `page_type`, `sequence`, `unit_id`, `created_at`, `updated_at`) VALUES ('Prueba tu conocimiento: usando el editor de texto', 'editor', 3, 2, '2015-11-02 16:49:47', '2015-11-02 16:49:47')

  def update
    respond_to do |format|
      @page = @unit.pages.find(params[:id])
      if @page.update(page_params)
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`unit_id` = 2 AND `pages`.`id` = 1 LIMIT 1
UPDATE `pages` SET `instructions` = 'Instrucciones:\r\n\r\n 1. Cambia el título “Esto es un título” por tu nombre\r\n 2. Cambia el texto del párrafo por algo que hable de ti\r\n 3. Al terminar dale click al botón de continuar', `updated_at` = '2015-11-03 15:46:59' WHERE `pages`.`id` = 3

  def saveAnswer
    answer = Answer.find_by_page_id_and_user_id(params[:page_id],current_user.id)
    if answer != nil
      answer.result = params[:answer]
      answer.save
---
SELECT  `answers`.* FROM `answers` WHERE `answers`.`page_id` = 3 AND `answers`.`user_id` = 8 LIMIT 1
UPDATE `answers` SET `result` = '<h1>Hola Mundo</h1>', `updated_at` = '2015-11-03 23:02:24' WHERE `answers`.`id` = 1

    def set_course
      @course = Course.find(params[:course_id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = NULL LIMIT 1

    def set_unit
      @unit = @course.units.find(params[:unit_id])
---
SELECT  `units`.* FROM `units` WHERE `units`.`course_id` = 3 AND `units`.`id` = 2 LIMIT 1