app/controllers/units_controller.rb

  def show
    @unit = @course.units.find(params[:id])
---
SELECT  `units`.* FROM `units` WHERE `units`.`course_id` = 3 AND `units`.`id` = 1 LIMIT 1

  def edit
    @unit = @course.units.find(params[:id])
---
SELECT  `units`.* FROM `units` WHERE `units`.`course_id` = 3 AND `units`.`id` = 1 LIMIT 1

  def create
    @unit = @course.units.new(unit_params)

    respond_to do |format|
      if @unit.save
---
INSERT INTO `units` (`title`, `description`, `course_id`, `created_at`, `updated_at`) VALUES ('Crea tu website', 'Crea un website desde cero', 3, '2015-10-31 04:16:59', '2015-10-31 04:16:59')

  def update
    respond_to do |format|
      @unit = @course.units.find(params[:id])
---
SELECT  `units`.* FROM `units` WHERE `units`.`course_id` = 3 AND `units`.`id` = 1 LIMIT 1

  def destroy
    @unit = @course.units.find(params[:id])
    @unit.destroy
---
SELECT  `units`.* FROM `units` WHERE `units`.`course_id` = 3 AND `units`.`id` = 1 LIMIT 1
DELETE FROM `units` WHERE `units`.`id` = 1

    def set_course
      @course = Course.find(params[:course_id])
---
SELECT  `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1