app/controllers/videos_controller.rb

  def index
    @videos = Video.all
---
SELECT `videos`.* FROM `videos`

  def create
    @video = Video.new(video_params)

    respond_to do |format|
      if @video.save
---
INSERT INTO `videos` (`title`, `content_file_name`, `content_content_type`, `content_file_size`, `content_updated_at`, `created_at`, `updated_at`) VALUES ('El editor de texto y el navegador', 'BigBuckBunny_320x180.mp4', 'video/mp4', 64657027, '2015-11-01 23:28:13', '2015-11-01 23:28:14', '2015-11-01 23:28:14')

  def update
    respond_to do |format|
      params[:video][:page_ids] ||= []
      if @video.update(video_params)
---
UPDATE `videos` SET `title` = 'Introducción', `updated_at` = '2015-11-01 00:52:22' WHERE `videos`.`id` = 1

  def destroy
    @video.destroy
---
DELETE FROM `videos` WHERE `videos`.`id` = 1

    def set_video
      @video = Video.find(params[:id])
---
SELECT  `videos`.* FROM `videos` WHERE `videos`.`id` = 1 LIMIT 1